Show / Hide Table of Contents
Class ReinforcedBar
Reinforced bar
Inheritance
System.Object
OpenObject
ReinforcedBar
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Services.Concrete.ReinforcedSection.ReinfBar,CI.ReinforcedSection")]
public class ReinforcedBar : OpenObject
Properties
Improve this Doc   View Source
Diameter
Diameter
Declaration
public double Diameter { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Material
Material
Declaration
public ReferenceElement Material { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
Point
Position of bar
Declaration
[OpenModelProperty("CentrePoint")]
public Point2D Point { get; set; }
Property Value
 Type |  Description
 Point2D
 Improve this Doc
 View Source